#Вывести на экран числа от -N до N
x = int(input())
for x in range (-x, x+1):
 print (x, end=' ')